In [10]:
import pandas as pd
import numpy as np
df1=pd.DataFrame(np.array([['a', 5, 9], ['b', 4, 61], ['c', 24, 9]]),columns=['name', 'attr1', 'attr2'])

In [11]:
df2=pd.DataFrame(np.array([['a', 5, 19], ['b', 4, 6],['c', 2, 9]]), columns=['name', 'attr1', 'attr2'])

In [12]:
df3=pd.DataFrame(np.array([['a', 5, 6],['b', 4, 78], ['c', 2, 10]]), columns=['name', 'attr1', 'attr2'])

In [13]:
df1

  name attr1 attr2
0    a     5     9
1    b     4    61
2    c    24     9

In [14]:
df2

  name attr1 attr2
0    a     5    19
1    b     4     6
2    c     2     9

In [15]:
df3

  name attr1 attr2
0    a     5     6
1    b     4    78
2    c     2    10

In [16]:
pd.merge(df1, df2, on='name', how='inner') ## Join two dataframe

  name attr1_x attr2_x attr1_y attr2_y
0    a       5       9       5      19
1    b       4      61       4       6
2    c      24       9       2       9

In [20]:
pd.merge((pd.merge(df1, df2, on='name', how='inner')), df3, on='name', how='inner' ) ## Joining three dataframe (1st-way)

  name attr1_x attr2_x attr1_y attr2_y attr1 attr2
0    a       5       9       5      19     5     6
1    b       4      61       4       6     4    78
2    c      24       9       2       9     2    10

In [25]:
df1.merge(df2, on='name').merge(df3, on='name')   ## Joining three dataframe (2st-way)

  name attr1_x attr2_x attr1_y attr2_y attr1 attr2
0    a       5       9       5      19     5     6
1    b       4      61       4       6     4    78
2    c      24       9       2       9     2    10

In [24]:
pd.merge(df1, df2, on=['name', 'attr1'], how='inner' ) ## Joining two dataframes on two columns

  name attr1 attr2_x attr2_y
0    a     5       9      19
1    b     4      61       6